<a href="https://colab.research.google.com/github/juandsalazars/pandas-training/blob/main/Pandas_series_exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Import the numpy package under the name np
import numpy as np

# Import the pandas package under the name pd
import pandas as pd

# Print the pandas version and the configuration
print(pd.__version__)

2.1.4

# Series creation

## Create an empty pandas Series

In [2]:
pd.Series()

Series([], dtype: object)

## Given the X python list convert it to an Y pandas Series

In [5]:
X = ['A', 'B', 'C', 'D']
Y = pd.Series(X)
print(X, type(X))
print(Y, type(Y))

['A', 'B', 'C', 'D'] <class 'list'>
0    A
1    B
2    C
3    D
dtype: object <class 'pandas.core.series.Series'>

## Given the X pandas Series, name it 'My letters'

In [6]:
X = pd.Series(['A', 'B', 'C', 'D'])
X.name = 'My letters'
X

0    A
1    B
2    C
3    D
Name: My letters, dtype: object

## Given the X pandas Series, show its values

In [7]:
X = pd.Series(['A', 'B', 'C', 'D'])
X.values

array(['A', 'B', 'C', 'D'], dtype=object)

# Series indexation

## Assign index names to the given X pandas Series

In [9]:
X = pd.Series(['A', 'B', 'C', 'D'])
X.index = ['first', 'second', 'third', 'fourth']
X

first     A
second    B
third     C
fourth    D
dtype: object

## Given the X pandas Series, show its first element

In [10]:
X = pd.Series(['A', 'B', 'C', 'D'])
X.iloc[0]

'A'

## Given the X pandas Series, show its last element

In [11]:
X = pd.Series(['A', 'B', 'C', 'D'])
X.iloc[-1]

'D'

## Given the X pandas Series, show all middle elements

In [13]:
X = pd.Series(['A', 'B', 'C', 'D'])
X.iloc[1:-1]

1    B
2    C
dtype: object

## Given the X pandas Series, show the elements in reverse position

In [14]:
X = pd.Series(['A', 'B', 'C', 'D'])
X.iloc[::-1]

3    D
2    C
1    B
0    A
dtype: object

## Given the X pandas Series, show the first and last elements

In [17]:
X = pd.Series(['A', 'B', 'C', 'D'])
X.iloc[[0, -1]]

0    A
3    D
dtype: object

# Series manipulation

## Convert the given integer pandas Series to float

In [21]:
X = pd.Series([1, 2, 3, 4])
X = pd.Series(X, dtype = float)
X

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

## Reverse the given pandas Series (first element becomes last)

In [24]:
X = pd.Series([1, 2, 3, 4])
print(X)
X = X[::-1]
print(X)

0    1
1    2
2    3
3    4
dtype: int64
3    4
2    3
1    2
0    1
dtype: int64

## Order (sort) the given pandas Series

In [26]:
X = pd.Series([3, 4, 1, 2])
X.sort_values()

2    1
3    2
0    3
1    4
dtype: int64

## Given the X pandas Series, set the fifth element equal to 10

In [27]:
X = pd.Series([1, 2, 3, 4, 5])
X[4] = 10
X

0     1
1     2
2     3
3     4
4    10
dtype: int64

## Given the X pandas Series, change all the middle elements to 0

In [29]:
X = pd.Series([1, 2, 3, 4, 5])
X[1:-1] = 0
X

0    1
1    0
2    0
3    0
4    5
dtype: int64

## Given the X pandas Series, add 5 to every element

In [31]:
X = pd.Series([1, 2, 3, 4, 5])
X += 5
X

0     6
1     7
2     8
3     9
4    10
dtype: int64

# Series boolean arrays (also called masks)

## Given the X pandas Series, make a mask showing negative elements

In [34]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
mask = X < 0
mask

0     True
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8     True
9    False
dtype: bool

## Given the X pandas Series, get the negative elements

In [35]:
X[X < 0]

0   -1
3   -4
8   -9
dtype: int64

## Given the X pandas Series, get numbers higher than 5

In [36]:
X[X > 5]

5     6
9    10
dtype: int64

## Given the X pandas Series, get numbers higher than the elements mean

In [37]:
X[X > X.mean()]

1     2
4     5
5     6
9    10
dtype: int64

## Given the X pandas Series, get numbers equal to 2 or 10

In [38]:
X[(X == 2) | (X == 10)]

1     2
9    10
dtype: int64

# Logic functions

## Given the X pandas Series, return True if none of its elements is zero

In [41]:
X.all()

False

## Given the X pandas Series, return True if any of its elements is zero

In [45]:
~X.all()

True

# Summary statistics

## Given the X pandas Series, show the sum of its elements

In [46]:
X = pd.Series([3,5,6,7,2,3,4,9,4])
X.sum()

43

## Given the X pandas Series, show the mean value of its elements

In [47]:
X.mean()

4.777777777777778

## Given the X pandas Series, show the max value of its elements

In [49]:
X.max()

9